# 题目要求
# 请你使用print()函数和'''将下面的丘比特之心打印出来，丘比特之心字符画会在【书写代码】步骤里直接提供。
# 题目讲解
# 除了文字和数字之外，我们还可以灵活运用print()函数，打印出带特殊格式的东西，例如：字符画。现在，请试着打印出一颗丘比特之心，成功打印后，请把你的丘比特之心分享到社群里吧。
print('''  ***                 ***   
 *********           *********
************       ************
*************     *************
**************   **************
*************** ***************
 *******    *** ***    *******
  ******     *****     ******
   ******     ***     ******
   ******     ***     ******
     ******    *     ******
       ******  *   ******
         **************
           **********
             ******
               ***
                *''')



# 题目要求
# 下面是哪吒呐喊的话，请你把这段话，运用转义字符按照如下格式打印出来。其中，具体文字会在【书写代码】步骤中直接提供。
# 题目讲解
# 哪吒在江湖中闯荡, 终于有一天, 在内心中发泄出自己不满，大声呐喊。

print('''去他个鸟命！
我命由我，不由天！
是魔是仙，我自己决定！
靠'自己'
''')

print("=======扩展题=====")

#1.  分别用单引号，双引号打印输出一句： 
#【大数据为人才赋能，AI引领未来】
#2. 使用多引号（三引号）打印 ：
#【先立一个小目标，
#挣他一个亿
#=（Q V Q）=】
print('【大数据为人才赋能，AI引领未来】')
print("【大数据为人才赋能，AI引领未来】")
print('''【先立一个小目标，
挣他一个亿
=（Q V Q）=】''')

#题目：
#使用一行代码打印输出以下内容（不可使用多引号，使用\n）
#====欢迎进入到身份认证系统V1.0====
#= 1. 登录
#= 2. 退出
#= 3. 认证
#= 4. 修改密码

print('#====欢迎进入到身份认证系统V1.0====\n= 1. 登录\n= 2. 退出\n= 3. 认证\n= 4. 修改密码')


#题目：
##自己定义三个变量名，并给它赋值，要求第一个名称为数字和字母任意组成，第二个名称为字母下划线组成，第三个名称为数字字母下划线组成。
firstName1=100;
second_Name='Tom';
threeName_1='Jack';
print(firstName1,second_Name,threeName_1)


